#include "stack.h"

char t[W];
const char* words[] = { "нуль", "одна", "двi", "три", "чотири", "п'€ть", "шiсть", "сiм", "вiсiм", "дев'€ть", "дес€ть", "одинадц€ть", "дванадц€ть", "тринадц€ть", "чотирнадц€ть", "п'€тнадц€ть", "шiстнадц€ть", "сiмнадц€ть", "вiсiмнадц€ть", "дев'€тнадц€ть", "двадц€ть", "двадц€ть одна", "двадц€ть двi", "двадц€ть три", "двадц€ть чотири", "двадц€ть п'€ть", "двадц€ть шiсть", "двадц€ть сiм", "двадц€ть вiсiм", "двадц€ть дев'€ть", "тридц€ть", "тридц€ть одна", "тридц€ть двi", "тридц€ть три", "тридц€ть чотири", "тридц€ть п'€ть", "тридц€ть шiсть", "тридц€ть сiм", "тридц€ть вiсiм", "тридц€ть дев'€ть", "сорок", "сорок одна", "сорок двi", "сорок три", "сорок чотири", "сорок п'€ть", "сорок шiсть", "сорок сiм", "сорок вiсiм", "сорок дев'€ть", "п'€тдес€т", "п'€тдес€т одна", "п'€тдес€т двi", "п'€тдес€т три", "п'€тдес€т чотири", "п'€тдес€т п'€ть", "п'€тдес€т шiсть", "п'€тдес€т сiм", "п'€тдес€т вiсiм", "п'€тдес€т дев'€ть" };
void Convertion(int h, int m) {
	int un;
	strcat(t, words[h]);
	un = h % 10;
	if ((un == 0) || ((un < 20) && (un > 10))) strcat(t, " годин ");
	else if (un == 1) strcat(t, " година ");
	else strcat(t, " години ");
	strcat(t, words[m]);
	un = m % 10;
	if ((un == 0) || ((un < 20) && (un > 10))) strcat(t, " хвилин");
	else if (un == 1) strcat(t, " хвилина");
	else strcat(t, " хвилини");
}